Revit 2025 API
Level.Create Method
 Creates a new instance of level based on an input elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static Level Create(
	Document document,
	double elevation
)
Public Shared Function Create (
	document As Document,
	elevation As Double
) As Level
public:
static Level^ Create(
	Document^ document,
	double elevation
)
static member Create :
        document : Document *
        elevation : float -> Level
Parameters
document Document
 The document in which the new instance is created
elevation Double
 The elevation of the level to be created.
Return Value
Level
 The newly created level instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Example
Level CreateLevel(Autodesk.Revit.DB.Document document)
{
    // The elevation to apply to the new level
    double elevation = 20.0;
    // Begin to create a level
    Level level = Level.Create(document, elevation);
    if (null == level)
    {
        throw new Exception("Create a new level failed.");
    }
    // Change the level name
    level.Name = "New level";
    return level;
}
Private Function CreateLevel(document As Autodesk.Revit.DB.Document) As Level
   ' The elevation to apply to the new level
   Dim elevation As Double = 20.0
   ' Begin to create a level
   Dim level As Level = level.Create(document, elevation)
   If level Is Nothing Then
      Throw New Exception("Create a new level failed.")
   End If
   ' Change the level name
   level.Name = "New level"
   Return level
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Level Class
Autodesk.Revit.DB Namespace